// Задача на деление двух чисел
double A = 100;
double B = 3;
Console.WriteLine("Ответ:");
Console.WriteLine(A/B);
