
// Вывести квадрат числа

Console.Write("Введите число: ");
int N = Convert.ToInt32(Console.ReadLine()!);
int S = N * N;

Console.Write("Ответ: ");
Console.Write(S);
