// Определить наибольшее из двух чисел
Console.Write("Укажите первое число: ");
int A = Convert.ToInt32(Console.ReadLine());
Console.Write("Укажите второе число: ");
int B = Convert.ToInt32(Console.ReadLine());

if (A > B) Console.WriteLine("Первое больше");
if (A < B) Console.WriteLine("Второе больше");